disk91/stm32-it-sdk/Src/stm32l_sdk/uart_wrapper.c
/* ==========================================================
 * uart_wrapper.c - wrapper function for uarts
 * Project : Disk91 SDK
 * ----------------------------------------------------------
 * Created on: 12 sept. 2018
 *     Author: Paul Pinault aka Disk91
 * ----------------------------------------------------------
 * Copyright (C) 2018 Disk91
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU LESSER General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Lesser Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 * ----------------------------------------------------------
 * Serial1 is LPUART
 * Serial2 is USART2
 * Debuh is non affected
 *
 * ==========================================================
 */
#include <string.h>
#include <it_sdk/config.h>
#if ITSDK_PLATFORM == __PLATFORM_STM32L0 || ITSDK_PLATFORM == __PLATFORM_STM32L4 || ITSDK_PLATFORM == __PLATFORM_STM32WLE
#include <it_sdk/logger/logger.h>
#include <it_sdk/wrappers.h>
#if ITSDK_PLATFORM == __PLATFORM_STM32L0
	#include "stm32l0xx_hal.h"
#elif ITSDK_PLATFORM == __PLATFORM_STM32L4
	#include "stm32l4xx.h"
	#include "stm32l4xx_hal_def.h"
#elif ITSDK_PLATFORM == __PLATFORM_STM32WLE
	#include "stm32wlxx_hal.h"
#endif
#if ITSDK_WITH_UART > 0
	#include "usart.h"
#endif

#if ITSDK_LOGGER_WITH_SEG_RTT == __ENABLE
#include <drivers/SeggerRTT/SEGGER_RTT.h>
#endif

// ---------------------------------------------------------------------------
// serial 1 - is mapped to LPUART1 or USART1
// ---------------------------------------------------------------------------

#if ( ITSDK_WITH_UART_RXIRQ & __UART_USART1 ) > 0 || ( ITSDK_WITH_UART_RXIRQ & __UART_LPUART1 ) > 0
uint8_t __serial1_buffer[ITSDK_WITH_UART_RXIRQ_BUFSZ];
volatile uint8_t __serial1_bufferRd = 0;
volatile uint8_t __serial1_bufferWr = 0;
#endif
#if ( ITSDK_WITH_UART_RXIRQ & __UART_USART2 ) > 0
uint8_t __serial2_buffer[ITSDK_WITH_UART_RXIRQ_BUFSZ];
volatile uint8_t __serial2_bufferRd = 0;
volatile uint8_t __serial2_bufferWr = 0;
#endif
#if ( ITSDK_WITH_UART_RXIRQ & __UART_USART3 ) > 0
uint8_t __serial3_buffer[ITSDK_WITH_UART_RXIRQ_BUFSZ];
volatile uint8_t __serial3_bufferRd = 0;
volatile uint8_t __serial3_bufferWr = 0;
#endif
#if ( ITSDK_WITH_UART_RXIRQ & __UART_USART4 ) > 0
uint8_t __serial4_buffer[ITSDK_WITH_UART_RXIRQ_BUFSZ];
volatile uint8_t __serial4_bufferRd = 0;
volatile uint8_t __serial4_bufferWr = 0;
#endif


void __serial_disable_it(UART_HandleTypeDef * h) {
    __HAL_UART_DISABLE_IT(h,UART_IT_ERR);
    __HAL_UART_DISABLE_IT(h,UART_IT_RXNE);
    __HAL_UART_DISABLE_IT(h,UART_IT_TC);
    __HAL_UART_DISABLE_IT(h,UART_IT_TXE);

    __HAL_UART_DISABLE_IT(h,UART_IT_PE);
    __HAL_UART_DISABLE_IT(h,UART_IT_IDLE);
    __HAL_UART_DISABLE_IT(h,UART_IT_LBD);
    __HAL_UART_DISABLE_IT(h,UART_IT_CTS);
    __HAL_UART_DISABLE_IT(h,UART_IT_CM);
    __HAL_UART_DISABLE_IT(h,UART_IT_WUF);
    __HAL_UART_DISABLE_IT(h,UART_IT_RTO);
    __HAL_UART_DISABLE_IT(h,UART_IT_ERR);
    __HAL_UART_DISABLE_IT(h,UART_IT_ORE);
    __HAL_UART_DISABLE_IT(h,UART_IT_NE);
    __HAL_UART_DISABLE_IT(h,UART_IT_FE);
}



/**
 * Init the Serial 1 extra configurations
 */
void serial1_init() {
#if ( ITSDK_WITH_UART_RXIRQ & __UART_USART1 ) > 0 || ( ITSDK_WITH_UART_RXIRQ & __UART_LPUART1 ) > 0
	#if ( ITSDK_WITH_UART_RXIRQ & __UART_LPUART1 ) > 0
		UART_HandleTypeDef * _uart = &hlpuart1;
	#elif  ( ITSDK_WITH_UART_RXIRQ & __UART_USART1 ) > 0
		UART_HandleTypeDef * _uart = &huart1;
	#endif

	__serial_disable_it(_uart);

    // Reset circular buffer
	itsdk_enterCriticalSection();
    __serial1_bufferRd = 0;
    __serial1_bufferWr = 0;
	itsdk_leaveCriticalSection();

	__HAL_UART_ENABLE_IT(_uart,UART_IT_ERR);
    __HAL_UART_ENABLE_IT(_uart,UART_IT_RXNE);
    // Clear pending interrupt & co
    _uart->Instance->RDR;
    _uart->Instance->ISR;
    _uart->Instance->ICR;
    // start IT reception
    __HAL_UART_CLEAR_FLAG(_uart, UART_CLEAR_OREF);
    HAL_UART_Receive_IT(_uart, __serial2_buffer, 1);

#endif
}

/**
 * Connect & configure the serial1
 */
void serial1_connect() {
#if ( ITSDK_WITH_UART & __UART_LPUART1 ) > 0 || ( ITSDK_WITH_UART & __UART_USART1) > 0
	#if (ITSDK_WITH_UART & __UART_LPUART1 ) > 0
		UART_HandleTypeDef * _uart = &hlpuart1;
	#elif  ( ITSDK_WITH_UART & __UART_USART1) > 0
		UART_HandleTypeDef * _uart = &huart1;
	#endif
		HAL_UART_MspInit(_uart);
#endif
}

/**
 * Disconnect the serail1 from the pads
 */
void serial1_disconnect() {
#if ( ITSDK_WITH_UART & __UART_LPUART1 ) > 0 || ( ITSDK_WITH_UART & __UART_USART1) > 0
	#if (ITSDK_WITH_UART & __UART_LPUART1 ) > 0
		UART_HandleTypeDef * _uart = &hlpuart1;
	#elif  ( ITSDK_WITH_UART & __UART_USART1) > 0
		UART_HandleTypeDef * _uart = &huart1;
	#endif
		HAL_UART_MspDeInit(_uart);
#endif
}

/**
 * flushing pending transmission
 */
void serial1_flush() {
  #if ( ITSDK_WITH_UART & __UART_LPUART1 ) > 0
     while(__HAL_UART_GET_FLAG(&hlpuart1, USART_ISR_BUSY) == SET);
     while(__HAL_UART_GET_FLAG(&hlpuart1, USART_ISR_TC) == RESET);
  #elif ( ITSDK_WITH_UART & __UART_USART1 ) > 0
	   while(__HAL_UART_GET_FLAG(&huart1, USART_ISR_BUSY) == SET);
	   while(__HAL_UART_GET_FLAG(&huart1, USART_ISR_TC) == RESET);
  #endif
}

void serial1_print(char * msg) {
  #if ( ITSDK_WITH_UART & __UART_LPUART1 ) > 0
	HAL_UART_Transmit(&hlpuart1, (uint8_t*)msg, strlen(msg),0xFFFF);
  #elif ( ITSDK_WITH_UART & __UART_USART1 ) > 0
	HAL_UART_Transmit(&huart1, (uint8_t*)msg, strlen(msg),0xFFFF);
  #endif
}

void serial1_write(uint8_t * bytes,uint16_t len) {
  #if ( ITSDK_WITH_UART & __UART_LPUART1 ) > 0
	HAL_UART_Transmit(&hlpuart1, bytes, len,0xFFFF);
  #elif ( ITSDK_WITH_UART & __UART_USART1 ) > 0
	HAL_UART_Transmit(&huart1, bytes, len,0xFFFF);
  #endif
}

void serial1_println(char * msg) {
  #if ( ITSDK_WITH_UART & __UART_LPUART1 ) > 0
	serial1_print(msg);
	char * eol = "\r\n";
	HAL_UART_Transmit(&hlpuart1, (uint8_t*)eol, strlen(eol),0xFFFF);
  #elif ( ITSDK_WITH_UART & __UART_USART1 ) > 0
	serial1_print(msg);
	char * eol = "\r\n";
	HAL_UART_Transmit(&huart1, (uint8_t*)eol, strlen(eol),0xFFFF);
  #endif
}

serial_read_response_e serial1_read(char * ch) {

