disk91/stm32-it-sdk/Src/stm32l_sdk/uart_wrapper.c
#if ( ITSDK_WITH_UART_RXIRQ & __UART_USART1 ) > 0 || ( ITSDK_WITH_UART_RXIRQ & __UART_LPUART1 ) > 0

	if ( __serial1_bufferRd != __serial1_bufferWr ) {
		// char available
		*ch = __serial1_buffer[__serial1_bufferRd];
		itsdk_enterCriticalSection();
		__serial1_bufferRd = (__serial1_bufferRd + 1) & (ITSDK_WITH_UART_RXIRQ_BUFSZ-1);
		itsdk_leaveCriticalSection();
		if ( __serial1_bufferRd != __serial1_bufferWr ) {
			return SERIAL_READ_PENDING_CHAR;
		} else {
			return SERIAL_READ_SUCCESS;
		}
	} else {
		return SERIAL_READ_NOCHAR;
	}


#else

  #if ( ITSDK_WITH_UART & __UART_LPUART1 ) > 0

	// buffer overflow
	if (__HAL_UART_GET_FLAG(&hlpuart1, UART_FLAG_ORE)) {
		__HAL_UART_CLEAR_FLAG(&hlpuart1, UART_FLAG_ORE);
	}

	// get one of the pending char if some.
	if (__HAL_UART_GET_FLAG(&hlpuart1, UART_FLAG_RXNE)){
		UART_MASK_COMPUTATION(&hlpuart1);
		*ch = hlpuart1.Instance->RDR & hlpuart1.Mask;

		if (__HAL_UART_GET_FLAG(&hlpuart1, UART_FLAG_RXNE)) {
			return SERIAL_READ_PENDING_CHAR;
		} else {
			return SERIAL_READ_SUCCESS;
		}
	}
	return SERIAL_READ_NOCHAR;
  #elif ( ITSDK_WITH_UART & __UART_USART1 ) > 0

	// buffer overflow
	if (__HAL_UART_GET_FLAG(&huart1, UART_FLAG_ORE)) {
		__HAL_UART_CLEAR_FLAG(&huart1, UART_FLAG_ORE);
	}

	// get one of the pending char if some.
	if (__HAL_UART_GET_FLAG(&huart1, UART_FLAG_RXNE)){
		UART_MASK_COMPUTATION(&huart1);
		*ch = huart1.Instance->RDR & huart1.Mask;
		if (__HAL_UART_GET_FLAG(&huart1, UART_FLAG_RXNE)) {
			return SERIAL_READ_PENDING_CHAR;
		} else {
			return SERIAL_READ_SUCCESS;
		}
	}
	return SERIAL_READ_NOCHAR;
  #else
	return SERIAL_READ_FAILED;
  #endif
#endif
}

/**
 * Change the Uart setting baudrate
 * Return BOOL_TRUE on success
 */
itsdk_bool_e serial1_changeBaudRate(serial_baudrate_e bd) {
  #if ( ITSDK_WITH_UART & ( __UART_USART1 | __UART_LPUART1 ) ) > 0
	UART_HandleTypeDef * lhuart;
	#if ( ITSDK_WITH_UART & __UART_LPUART1 ) > 0
		lhuart = &hlpuart1;
	#elif ( ITSDK_WITH_UART & __UART_USART1 ) > 0
		lhuart = &huart1;
	#else
		return BOOL_FALSE;
	#endif
	switch( bd ) {
		case SERIAL_SPEED_300 : lhuart->Init.BaudRate = 300; break;
		case SERIAL_SPEED_600 : lhuart->Init.BaudRate = 600; break;
		case SERIAL_SPEED_1200 : lhuart->Init.BaudRate = 1200; break;
		case SERIAL_SPEED_2400 : lhuart->Init.BaudRate = 2400; break;
		case SERIAL_SPEED_4800 : lhuart->Init.BaudRate = 4800; break;
		default:
		case SERIAL_SPEED_9600 : lhuart->Init.BaudRate = 9600; break;
		case SERIAL_SPEED_19200 : lhuart->Init.BaudRate = 19200; break;
		case SERIAL_SPEED_38400 : lhuart->Init.BaudRate = 38400; break;
		case SERIAL_SPEED_57600 : lhuart->Init.BaudRate = 57600; break;
		case SERIAL_SPEED_115200 : lhuart->Init.BaudRate = 115200; break;
	}
	serial1_flush();
	if (HAL_UART_Init(lhuart) != HAL_OK) {
	  return BOOL_FALSE;
	}
	serial1_init();
	return BOOL_TRUE;
  #else
	return BOOL_FALSE;
  #endif
}

// ---------------------------------------------------------------------------
// serial 2 - is mapped to USART2
// ---------------------------------------------------------------------------


/**
 * Init the Serial 2 extra configurations
 */
void serial2_init() {
#if  ( ITSDK_WITH_UART_RXIRQ & __UART_USART2 ) > 0
	__serial_disable_it(&huart2);
	itsdk_enterCriticalSection();
    __serial2_bufferRd = 0;
    __serial2_bufferWr = 0;
	itsdk_leaveCriticalSection();
    __HAL_UART_ENABLE_IT(&huart2,UART_IT_ERR);
    __HAL_UART_ENABLE_IT(&huart2,UART_IT_RXNE);
    huart2.Instance->RDR;
    huart2.Instance->ISR;
    huart2.Instance->ICR;
    // start IT reception
    __HAL_UART_CLEAR_FLAG(&huart2, UART_CLEAR_OREF);
    HAL_UART_Receive_IT(&huart2, __serial2_buffer, 1);

    #endif
}

/**
 * Connect & configure the serial1
 */
void serial2_connect() {
#if ( ITSDK_WITH_UART & __UART_USART2 ) > 0
	HAL_UART_MspInit(&huart2);
#endif
}

/**
 * Disconnect the serail1 from the pads
 */
void serial2_disconnect() {
#if ( ITSDK_WITH_UART & __UART_USART2 ) > 0
	HAL_UART_MspDeInit(&huart2);
#endif
}

void serial2_flush() {
  #if ( ITSDK_WITH_UART & __UART_USART2 ) > 0
  while((__HAL_UART_GET_FLAG(&huart2, USART_ISR_BUSY)) == SET);
  while((__HAL_UART_GET_FLAG(&huart2, USART_ISR_TC)) == RESET);
  #endif
}

void serial2_print(char * msg) {
  #if ( ITSDK_WITH_UART & __UART_USART2 ) > 0
	HAL_UART_Transmit(&huart2, (uint8_t*)msg, strlen(msg),0xFFFF);
  #endif
}

void serial2_write(uint8_t * bytes,uint16_t len) {
#if ( ITSDK_WITH_UART & __UART_USART2 ) > 0
	HAL_UART_Transmit(&huart2, bytes, len,0xFFFF);
#endif
}

void serial2_println(char * msg) {
  #if ( ITSDK_WITH_UART & __UART_USART2 ) > 0
	serial2_print(msg);
	char * eol = "\r\n";
	HAL_UART_Transmit(&huart2, (uint8_t*)eol, strlen(eol),0xFFFF);
  #endif
}

serial_read_response_e serial2_read(char * ch) {

#if  ( ITSDK_WITH_UART_RXIRQ & __UART_USART2 ) > 0

	if ( __serial2_bufferRd != __serial2_bufferWr ) {
		// char available
		*ch = __serial2_buffer[__serial2_bufferRd];
		itsdk_enterCriticalSection();
		__serial2_bufferRd = (__serial2_bufferRd + 1) & (ITSDK_WITH_UART_RXIRQ_BUFSZ-1);
		itsdk_leaveCriticalSection();
		if ( __serial2_bufferRd != __serial2_bufferWr ) {
			return SERIAL_READ_PENDING_CHAR;
		} else {
			return SERIAL_READ_SUCCESS;
		}
	} else {
		return SERIAL_READ_NOCHAR;
	}

#else
  #if ( ITSDK_WITH_UART & __UART_USART2 ) > 0

	// buffer overflow
	if (__HAL_UART_GET_FLAG(&huart2, UART_FLAG_ORE)) {
		__HAL_UART_CLEAR_FLAG(&huart2, UART_FLAG_ORE);
	}

	// get one of the pending char if some.
	if (__HAL_UART_GET_FLAG(&huart2, UART_FLAG_RXNE)){
		UART_MASK_COMPUTATION(&huart2);
		*ch = huart2.Instance->RDR & huart2.Mask;
		if (__HAL_UART_GET_FLAG(&huart2, UART_FLAG_RXNE)) {
			return SERIAL_READ_PENDING_CHAR;
		} else {
			return SERIAL_READ_SUCCESS;
		}
	}
	return SERIAL_READ_NOCHAR;
  #else
	return SERIAL_READ_FAILED;
  #endif
#endif
}

/**
 * Change the Uart setting baudrate
 * Return BOOL_TRUE on success
 */
itsdk_bool_e serial2_changeBaudRate(serial_baudrate_e bd) {
  #if ( ITSDK_WITH_UART_RXIRQ & __UART_USART2 ) > 0
	UART_HandleTypeDef * lhuart;
	#if  ( ITSDK_WITH_UART & __UART_USART2 ) > 0
	   lhuart = &huart2;
	#else
		return BOOL_FALSE;
	#endif
	switch( bd ) {
		case SERIAL_SPEED_300 : lhuart->Init.BaudRate = 300; break;
		case SERIAL_SPEED_600 : lhuart->Init.BaudRate = 600; break;
		case SERIAL_SPEED_1200 : lhuart->Init.BaudRate = 1200; break;
		case SERIAL_SPEED_2400 : lhuart->Init.BaudRate = 2400; break;
		case SERIAL_SPEED_4800 : lhuart->Init.BaudRate = 4800; break;
		default:
		case SERIAL_SPEED_9600 : lhuart->Init.BaudRate = 9600; break;
		case SERIAL_SPEED_19200 : lhuart->Init.BaudRate = 19200; break;
		case SERIAL_SPEED_38400 : lhuart->Init.BaudRate = 38400; break;
		case SERIAL_SPEED_57600 : lhuart->Init.BaudRate = 57600; break;
		case SERIAL_SPEED_115200 : lhuart->Init.BaudRate = 115200; break;
	}
	serial2_flush();
	if (HAL_UART_Init(lhuart) != HAL_OK) {
	  return BOOL_FALSE;
	}
	serial2_init();
	return BOOL_TRUE;
  #else
	return BOOL_FALSE;
  #endif
}


// ---------------------------------------------------------------------------
// serial 3 - is mapped to USART3
// ---------------------------------------------------------------------------

/**
 * Init the Serial 3 extra configurations
 */
void serial3_init() {
#if  ( ITSDK_WITH_UART_RXIRQ & __UART_USART3 ) > 0
	__serial_disable_it(&huart3);
	itsdk_enterCriticalSection();
    __serial3_bufferRd = 0;
    __serial3_bufferWr = 0;
	itsdk_leaveCriticalSection();
    __HAL_UART_ENABLE_IT(&huart3,UART_IT_ERR);
    __HAL_UART_ENABLE_IT(&huart3,UART_IT_RXNE);
    huart3.Instance->RDR;
    huart3.Instance->ISR;
    huart3.Instance->ICR;
    // start IT reception
    __HAL_UART_CLEAR_FLAG(&huart3, UART_CLEAR_OREF);
    HAL_UART_Receive_IT(&huart3, __serial2_buffer, 1);
#endif
}

/**
 * Connect & configure the serial1
 */
void serial3_connect() {
#if ( ITSDK_WITH_UART & __UART_USART3 ) > 0
	HAL_UART_MspInit(&huart3);
#endif
}

/**
 * Disconnect the serail1 from the pads
 */
void serial3_disconnect() {
#if ( ITSDK_WITH_UART & __UART_USART3 ) > 0
	HAL_UART_MspDeInit(&huart3);
#endif
}

