disk91/stm32-it-sdk/Src/stm32l_sdk/uart_wrapper.c
void serial3_flush() {
  #if ( ITSDK_WITH_UART & __UART_USART3 ) > 0
  while((__HAL_UART_GET_FLAG(&huart3, USART_ISR_BUSY)) == SET);
  while((__HAL_UART_GET_FLAG(&huart3, USART_ISR_TC)) == RESET);
  #endif
}

void serial3_print(char * msg) {
  #if ( ITSDK_WITH_UART & __UART_USART3 ) > 0
	HAL_UART_Transmit(&huart3, (uint8_t*)msg, strlen(msg),0xFFFF);
  #endif
}

void serial3_write(uint8_t * bytes,uint16_t len) {
#if ( ITSDK_WITH_UART & __UART_USART3 ) > 0
	HAL_UART_Transmit(&huart3, bytes, len,0xFFFF);
#endif
}

void serial3_println(char * msg) {
  #if ( ITSDK_WITH_UART & __UART_USART3 ) > 0
	serial3_print(msg);
	char * eol = "\r\n";
	HAL_UART_Transmit(&huart3, (uint8_t*)eol, strlen(eol),0xFFFF);
  #endif
}

serial_read_response_e serial3_read(char * ch) {

#if  ( ITSDK_WITH_UART_RXIRQ & __UART_USART3 ) > 0

	if ( __serial3_bufferRd != __serial3_bufferWr ) {
		// char available
		*ch = __serial3_buffer[__serial3_bufferRd];
		itsdk_enterCriticalSection();
		__serial3_bufferRd = (__serial3_bufferRd + 1) & (ITSDK_WITH_UART_RXIRQ_BUFSZ-1);
		itsdk_leaveCriticalSection();
		if ( __serial3_bufferRd != __serial3_bufferWr ) {
			return SERIAL_READ_PENDING_CHAR;
		} else {
			return SERIAL_READ_SUCCESS;
		}
	} else {
		return SERIAL_READ_NOCHAR;
	}

#else
  #if ( ITSDK_WITH_UART & __UART_USART3 ) > 0

	// buffer overflow
	if (__HAL_UART_GET_FLAG(&huart3, UART_FLAG_ORE)) {
		__HAL_UART_CLEAR_FLAG(&huart3, UART_FLAG_ORE);
	}

	// get one of the pending char if some.
	if (__HAL_UART_GET_FLAG(&huart3, UART_FLAG_RXNE)){
		UART_MASK_COMPUTATION(&huart3);
		*ch = huart3.Instance->RDR & huart3.Mask;
		if (__HAL_UART_GET_FLAG(&huart3, UART_FLAG_RXNE)) {
			return SERIAL_READ_PENDING_CHAR;
		} else {
			return SERIAL_READ_SUCCESS;
		}
	}
	return SERIAL_READ_NOCHAR;
  #else
	return SERIAL_READ_FAILED;
  #endif
#endif
}

/**
 * Change the Uart setting baudrate
 * Return BOOL_TRUE on success
 */
itsdk_bool_e serial3_changeBaudRate(serial_baudrate_e bd) {
  #if ( ITSDK_WITH_UART_RXIRQ & __UART_USART3 ) > 0
	UART_HandleTypeDef * lhuart;
	#if  ( ITSDK_WITH_UART & __UART_USART3 ) > 0
	   lhuart = &huart3;
	#else
		return BOOL_FALSE;
	#endif
	switch( bd ) {
		case SERIAL_SPEED_300 : lhuart->Init.BaudRate = 300; break;
		case SERIAL_SPEED_600 : lhuart->Init.BaudRate = 600; break;
		case SERIAL_SPEED_1200 : lhuart->Init.BaudRate = 1200; break;
		case SERIAL_SPEED_2400 : lhuart->Init.BaudRate = 2400; break;
		case SERIAL_SPEED_4800 : lhuart->Init.BaudRate = 4800; break;
		default:
		case SERIAL_SPEED_9600 : lhuart->Init.BaudRate = 9600; break;
		case SERIAL_SPEED_19200 : lhuart->Init.BaudRate = 19200; break;
		case SERIAL_SPEED_38400 : lhuart->Init.BaudRate = 38400; break;
		case SERIAL_SPEED_57600 : lhuart->Init.BaudRate = 57600; break;
		case SERIAL_SPEED_115200 : lhuart->Init.BaudRate = 115200; break;
	}
	serial3_flush();
	if (HAL_UART_Init(lhuart) != HAL_OK) {
	  return BOOL_FALSE;
	}
	serial3_init();
	return BOOL_TRUE;
  #else
	return BOOL_FALSE;
  #endif
}


// ---------------------------------------------------------------------------
// serial 4 - is mapped to USART4
// ---------------------------------------------------------------------------

/**
 * Init the Serial 4 extra configurations
 */
void serial4_init() {
#if  ( ITSDK_WITH_UART_RXIRQ & __UART_USART4 ) > 0
	__serial_disable_it(&huart4);
	itsdk_enterCriticalSection();
    __serial4_bufferRd = 0;
    __serial4_bufferWr = 0;
	itsdk_leaveCriticalSection();
    __HAL_UART_ENABLE_IT(&huart4,UART_IT_ERR);
    __HAL_UART_ENABLE_IT(&huart4,UART_IT_RXNE);
    huart4.Instance->RDR;
    huart4.Instance->ISR;
    huart4.Instance->ICR;
    // start IT reception
    __HAL_UART_CLEAR_FLAG(&huart4, UART_CLEAR_OREF);
    HAL_UART_Receive_IT(&huart4, __serial2_buffer, 1);
#endif
}

/**
 * Connect & configure the serial1
 */
void serial4_connect() {
#if ( ITSDK_WITH_UART & __UART_USART4 ) > 0
	HAL_UART_MspInit(&huart4);
#endif
}

/**
 * Disconnect the serail1 from the pads
 */
void serial4_disconnect() {
#if ( ITSDK_WITH_UART & __UART_USART4 ) > 0
	HAL_UART_MspDeInit(&huart4);
#endif
}

void serial4_flush() {
  #if ( ITSDK_WITH_UART & __UART_USART4 ) > 0
  while((__HAL_UART_GET_FLAG(&huart4, USART_ISR_BUSY)) == SET);
  while((__HAL_UART_GET_FLAG(&huart4, USART_ISR_TC)) == RESET);
  #endif
}

void serial4_print(char * msg) {
  #if ( ITSDK_WITH_UART & __UART_USART4 ) > 0
	HAL_UART_Transmit(&huart4, (uint8_t*)msg, strlen(msg),0xFFFF);
  #endif
}

void serial4_write(uint8_t * bytes,uint16_t len) {
#if ( ITSDK_WITH_UART & __UART_USART4 ) > 0
	HAL_UART_Transmit(&huart4, bytes, len,0xFFFF);
#endif
}

void serial4_println(char * msg) {
  #if ( ITSDK_WITH_UART & __UART_USART4 ) > 0
	serial4_print(msg);
	char * eol = "\r\n";
	HAL_UART_Transmit(&huart4, (uint8_t*)eol, strlen(eol),0xFFFF);
  #endif
}

serial_read_response_e serial4_read(char * ch) {

#if  ( ITSDK_WITH_UART_RXIRQ & __UART_USART4 ) > 0

	if ( __serial4_bufferRd != __serial4_bufferWr ) {
		// char available
		*ch = __serial4_buffer[__serial4_bufferRd];
		itsdk_enterCriticalSection();
		__serial4_bufferRd = (__serial4_bufferRd + 1) & (ITSDK_WITH_UART_RXIRQ_BUFSZ-1);
		itsdk_leaveCriticalSection();
		if ( __serial4_bufferRd != __serial4_bufferWr ) {
			return SERIAL_READ_PENDING_CHAR;
		} else {
			return SERIAL_READ_SUCCESS;
		}
	} else {
		return SERIAL_READ_NOCHAR;
	}

#else
  #if ( ITSDK_WITH_UART & __UART_USART4 ) > 0

	// buffer overflow
	if (__HAL_UART_GET_FLAG(&huart4, UART_FLAG_ORE)) {
		__HAL_UART_CLEAR_FLAG(&huart4, UART_FLAG_ORE);
	}

	// get one of the pending char if some.
	if (__HAL_UART_GET_FLAG(&huart4, UART_FLAG_RXNE)){
		UART_MASK_COMPUTATION(&huart4);
		*ch = huart4.Instance->RDR & huart4.Mask;
		if (__HAL_UART_GET_FLAG(&huart4, UART_FLAG_RXNE)) {
			return SERIAL_READ_PENDING_CHAR;
		} else {
			return SERIAL_READ_SUCCESS;
		}
	}
	return SERIAL_READ_NOCHAR;
  #else
	return SERIAL_READ_FAILED;
  #endif
#endif
}

/**
 * Change the Uart setting baudrate
 * Return BOOL_TRUE on success
 */
itsdk_bool_e serial4_changeBaudRate(serial_baudrate_e bd) {
  #if ( ITSDK_WITH_UART_RXIRQ & __UART_USART4 ) > 0
	UART_HandleTypeDef * lhuart;
	#if  ( ITSDK_WITH_UART & __UART_USART4 ) > 0
	   lhuart = &huart4;
	#else
		return BOOL_FALSE;
	#endif
	switch( bd ) {
		case SERIAL_SPEED_300 : lhuart->Init.BaudRate = 300; break;
		case SERIAL_SPEED_600 : lhuart->Init.BaudRate = 600; break;
		case SERIAL_SPEED_1200 : lhuart->Init.BaudRate = 1200; break;
		case SERIAL_SPEED_2400 : lhuart->Init.BaudRate = 2400; break;
		case SERIAL_SPEED_4800 : lhuart->Init.BaudRate = 4800; break;
		default:
		case SERIAL_SPEED_9600 : lhuart->Init.BaudRate = 9600; break;
		case SERIAL_SPEED_19200 : lhuart->Init.BaudRate = 19200; break;
		case SERIAL_SPEED_38400 : lhuart->Init.BaudRate = 38400; break;
		case SERIAL_SPEED_57600 : lhuart->Init.BaudRate = 57600; break;
		case SERIAL_SPEED_115200 : lhuart->Init.BaudRate = 115200; break;
	}
	serial4_flush();
	if (HAL_UART_Init(lhuart) != HAL_OK) {
	  return BOOL_FALSE;
	}
	serial4_init();
	return BOOL_TRUE;
  #else
	return BOOL_FALSE;
  #endif
}

// ---------------------------------------------------------------------------
// Global interrupt management
// ---------------------------------------------------------------------------


#if defined ITSDK_WITH_UART_RXIRQ && ITSDK_WITH_UART_RXIRQ != __UART_NONE
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart) {
	// Clear the error flags
	__HAL_UART_CLEAR_FLAG(huart, UART_FLAG_ORE);
	__HAL_UART_CLEAR_FLAG(huart, UART_FLAG_NE);
	__HAL_UART_CLEAR_FLAG(huart, UART_FLAG_FE);
}

