disk91/stm32-it-sdk/Src/stm32l_sdk/uart_wrapper.c
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {

	if (   __HAL_UART_GET_FLAG(huart, UART_FLAG_ORE)
		|| __HAL_UART_GET_FLAG(huart, UART_FLAG_NE)
		|| __HAL_UART_GET_FLAG(huart, UART_FLAG_FE)
	) {
		__HAL_UART_CLEAR_FLAG(huart, UART_FLAG_ORE);
		__HAL_UART_CLEAR_FLAG(huart, UART_FLAG_NE);
		__HAL_UART_CLEAR_FLAG(huart, UART_FLAG_FE);
	}

    do {
		if ( false
			#if ( ITSDK_WITH_UART & __UART_LPUART1 ) > 0
				|| huart->Instance == LPUART1
			#endif
			#if ( ITSDK_WITH_UART & __UART_USART1 ) > 0
				|| huart->Instance == USART1
			#endif
		) {
			#if ( ITSDK_WITH_UART_RXIRQ & __UART_LPUART1 ) > 0 || ( ITSDK_WITH_UART_RXIRQ & __UART_USART1 ) > 0
			// at this point the data is in __serial1_buffer[__serial1_bufferWr]
			// only increment the pointer when we have an available space in the circular buffer
			if ( ((__serial1_bufferWr+1) & (ITSDK_WITH_UART_RXIRQ_BUFSZ-1)) != __serial1_bufferRd  ) {
				__serial1_bufferWr = ((__serial1_bufferWr+1) & (ITSDK_WITH_UART_RXIRQ_BUFSZ-1));
			}
			HAL_UART_Receive_IT(huart, &__serial1_buffer[__serial1_bufferWr], 1);
			#endif
		#if ( ITSDK_WITH_UART & __UART_USART2 ) > 0
		} else if ( huart->Instance == USART2 ) {
			#if ( ITSDK_WITH_UART_RXIRQ & __UART_USART2 ) > 0
				// at this point the data is in __serial2_buffer[__serial2_bufferWr]
				if ( ((__serial2_bufferWr+1) & (ITSDK_WITH_UART_RXIRQ_BUFSZ-1)) != __serial2_bufferRd  ) {
					__serial2_bufferWr = ((__serial2_bufferWr+1) & (ITSDK_WITH_UART_RXIRQ_BUFSZ-1));
				}
				HAL_UART_Receive_IT(huart, &__serial2_buffer[__serial2_bufferWr], 1);
			#endif
		#endif
		#if ( ITSDK_WITH_UART & __UART_USART3 ) > 0
		} else if ( huart->Instance == USART3 ) {
			#if ( ITSDK_WITH_UART_RXIRQ & __UART_USART3 ) > 0
				// at this point the data is in __serial3_buffer[__serial3_bufferWr]
				if ( ((__serial3_bufferWr+1) & (ITSDK_WITH_UART_RXIRQ_BUFSZ-1)) != __serial3_bufferRd  ) {
					__serial3_bufferWr = ((__serial3_bufferWr+1) & (ITSDK_WITH_UART_RXIRQ_BUFSZ-1));
				}
				HAL_UART_Receive_IT(huart, &__serial3_buffer[__serial3_bufferWr], 1);
			#endif
		#endif
		#if ( ITSDK_WITH_UART & __UART_USART4 ) > 0
		} else if ( huart->Instance == UART4 ) {
			#if ( ITSDK_WITH_UART_RXIRQ & __UART_USART4 ) > 0
				// at this point the data is in __serial4_buffer[__serial4_bufferWr]
				if ( ((__serial4_bufferWr+1) & (ITSDK_WITH_UART_RXIRQ_BUFSZ-1)) != __serial4_bufferRd  ) {
					__serial4_bufferWr = ((__serial4_bufferWr+1) & (ITSDK_WITH_UART_RXIRQ_BUFSZ-1));
				}
				HAL_UART_Receive_IT(huart, &__serial4_buffer[__serial4_bufferWr], 1);
			#endif
		#endif
		} else {
			// default case, get it and drop it
			uint8_t c;
			HAL_UART_Receive_IT(huart, &c, 1);
		}
	} while ( __HAL_UART_GET_FLAG(huart, UART_FLAG_RXNE) );

}

#endif

// ---------------------------------------------------------------------------
// debug - is not mapped
// ---------------------------------------------------------------------------

void debug_flush() {
}

void debug_print(debug_print_type_e lvl, char * msg) {
#if ITSDK_LOGGER_WITH_SEG_RTT == __ENABLE
	static uint8_t wasEndLine = 1;
	if ( wasEndLine == 1 ) {
		switch (lvl) {
		case DEBUG_PRINT_DEBUG:
			SEGGER_RTT_WriteString(0,RTT_CTRL_BG_BRIGHT_CYAN);
			SEGGER_RTT_WriteString(0,"DEBUG    ");
			break;
		case DEBUG_PRINT_WARNING:
			SEGGER_RTT_WriteString(0,RTT_CTRL_BG_BRIGHT_MAGENTA);
			SEGGER_RTT_WriteString(0,"WARNING  ");
			break;
		case DEBUG_PRINT_ERROR:
			SEGGER_RTT_WriteString(0,RTT_CTRL_BG_BRIGHT_RED);
			SEGGER_RTT_WriteString(0,RTT_CTRL_TEXT_BRIGHT_BLACK);
			SEGGER_RTT_WriteString(0,"ERROR    ");
			break;
		default:
		case DEBUG_PRINT_INFO:
		case DEBUG_PRINT_ANY:
			SEGGER_RTT_WriteString(0,RTT_CTRL_BG_BRIGHT_WHITE);
			SEGGER_RTT_WriteString(0,RTT_CTRL_TEXT_BRIGHT_BLACK);
			SEGGER_RTT_WriteString(0,"INFO     ");
			break;
		}
	}
	SEGGER_RTT_WriteString(0,RTT_CTRL_RESET);
	switch (lvl) {
	case DEBUG_PRINT_DEBUG:
		SEGGER_RTT_WriteString(0,RTT_CTRL_TEXT_BRIGHT_CYAN);
		break;
	case DEBUG_PRINT_WARNING:
		SEGGER_RTT_WriteString(0,RTT_CTRL_TEXT_BRIGHT_MAGENTA);
		break;
	case DEBUG_PRINT_ERROR:
		SEGGER_RTT_WriteString(0,RTT_CTRL_TEXT_BRIGHT_RED);
		break;
	default:
		break;
	}
	SEGGER_RTT_WriteString(0, msg);
	SEGGER_RTT_WriteString(0,RTT_CTRL_RESET);
	int v = strlen(msg);
	wasEndLine = ( msg[v-1] == '\r' || msg[v-1] == '\n' )?1:0;
#endif
}

#endif // ITSDK_PLATFORM == __PLATFORM_STM32L0 || ITSDK_PLATFORM == __PLATFORM_STM32L4 || ITSDK_PLATFORM == __PLATFORM_STM32WLE

